In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
           "year": [2018, 2017, 2016, 2015, 2018],
           "points": [2.9, 3.7, 4.6, 5.4, 6.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])

In [3]:
df

       year     names  points penalty
one    2018  sunyoung     2.9     NaN
two    2017  sunyoung     3.7     NaN
three  2016  sunyoung     4.6     NaN
four   2015   jungjae     5.4     NaN
five   2018   jungjae     6.9     NaN

In [4]:
df["names"]

one      sunyoung
two      sunyoung
three    sunyoung
four      jungjae
five      jungjae
Name: names, dtype: object

In [5]:
df["year"]

one      2018
two      2017
three    2016
four     2015
five     2018
Name: year, dtype: int64

In [6]:
df.names

one      sunyoung
two      sunyoung
three    sunyoung
four      jungjae
five      jungjae
Name: names, dtype: object

In [7]:
df[["names","year"]]

          names  year
one    sunyoung  2018
two    sunyoung  2017
three  sunyoung  2016
four    jungjae  2015
five    jungjae  2018

In [8]:
df

       year     names  points penalty
one    2018  sunyoung     2.9     NaN
two    2017  sunyoung     3.7     NaN
three  2016  sunyoung     4.6     NaN
four   2015   jungjae     5.4     NaN
five   2018   jungjae     6.9     NaN

In [9]:
df["penalty"] = 0.2

In [10]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.2
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.2
four   2015   jungjae     5.4      0.2
five   2018   jungjae     6.9      0.2

In [11]:
df["penalty"] = [0.1, 0.2, 0.3, 0.4, 0.5] 
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5

In [12]:
df["rank"] = np.arange(5)

In [13]:
df

       year     names  points  penalty  rank
one    2018  sunyoung     2.9      0.1     0
two    2017  sunyoung     3.7      0.2     1
three  2016  sunyoung     4.6      0.3     2
four   2015   jungjae     5.4      0.4     3
five   2018   jungjae     6.9      0.5     4

In [14]:
df.rank

<bound method NDFrame.rank of        year     names  points  penalty  rank
one    2018  sunyoung     2.9      0.1     0
two    2017  sunyoung     3.7      0.2     1
three  2016  sunyoung     4.6      0.3     2
four   2015   jungjae     5.4      0.4     3
five   2018   jungjae     6.9      0.5     4>

In [16]:
# 에러
# del df.rank

In [17]:
del df["rank"]

In [18]:
df

       year     names  points  penalty
one    2018  sunyoung     2.9      0.1
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4
five   2018   jungjae     6.9      0.5

In [22]:
#del df[ "year":"points"]
#del df[1:3] 
#del df[ ["year","names"]]

In [23]:
df['num'] = np.arange(5)

In [24]:
df

       year     names  points  penalty  num
one    2018  sunyoung     2.9      0.1    0
two    2017  sunyoung     3.7      0.2    1
three  2016  sunyoung     4.6      0.3    2
four   2015   jungjae     5.4      0.4    3
five   2018   jungjae     6.9      0.5    4

In [25]:
val = pd.Series([-1.2, -1.3, -1.4], index=["two","four","five"] )
df["debt"] =val

In [26]:
df

       year     names  points  penalty  num  debt
one    2018  sunyoung     2.9      0.1    0   NaN
two    2017  sunyoung     3.7      0.2    1  -1.2
three  2016  sunyoung     4.6      0.3    2   NaN
four   2015   jungjae     5.4      0.4    3  -1.3
five   2018   jungjae     6.9      0.5    4  -1.4

In [27]:
df["net_points"] = df["points"] - df["penalty"]

In [28]:
df

       year     names  points  penalty  num  debt  net_points
one    2018  sunyoung     2.9      0.1    0   NaN         2.8
two    2017  sunyoung     3.7      0.2    1  -1.2         3.5
three  2016  sunyoung     4.6      0.3    2   NaN         4.3
four   2015   jungjae     5.4      0.4    3  -1.3         5.0
five   2018   jungjae     6.9      0.5    4  -1.4         6.4

In [29]:
df["high_points"] = df["net_points"] > 3.0

In [30]:
df

       year     names  points  penalty  num  debt  net_points  high_points
one    2018  sunyoung     2.9      0.1    0   NaN         2.8        False
two    2017  sunyoung     3.7      0.2    1  -1.2         3.5         True
three  2016  sunyoung     4.6      0.3    2   NaN         4.3         True
four   2015   jungjae     5.4      0.4    3  -1.3         5.0         True
five   2018   jungjae     6.9      0.5    4  -1.4         6.4         True

In [31]:
del df["high_points"]

In [32]:
del df["net_points"]

In [33]:
del df["num"]

In [34]:
df

       year     names  points  penalty  debt
one    2018  sunyoung     2.9      0.1   NaN
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.3
five   2018   jungjae     6.9      0.5  -1.4

In [35]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'debt'], dtype='object')

In [36]:
df.index.name="Order"
df.columns.name = "Info"

In [37]:
df

Info   year     names  points  penalty  debt
Order
one    2018  sunyoung     2.9      0.1   NaN
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.3
five   2018   jungjae     6.9      0.5  -1.4

In [39]:
#df[0]

In [40]:
df[0:3]

Info   year     names  points  penalty  debt
Order
one    2018  sunyoung     2.9      0.1   NaN
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN

In [41]:
df["two":"four"]

Info   year     names  points  penalty  debt
Order
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.3

In [42]:
df.loc["two"]

Info
year           2017
names      sunyoung
points          3.7
penalty         0.2
debt           -1.2
Name: two, dtype: object

In [43]:
df.loc["two":"four"]

Info   year     names  points  penalty  debt
Order
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.3

In [44]:
df.loc["two":"four", "points"]

Order
two      3.7
three    4.6
four     5.4
Name: points, dtype: float64

In [45]:
df.loc[ : , "year" ]

Order
one      2018
two      2017
three    2016
four     2015
five     2018
Name: year, dtype: int64

In [46]:
df.loc[:, ["year","names"]]

Info   year     names
Order
one    2018  sunyoung
two    2017  sunyoung
three  2016  sunyoung
four   2015   jungjae
five   2018   jungjae

In [47]:
df.loc["two":"four", ["year","names"]]

Info   year     names
Order
two    2017  sunyoung
three  2016  sunyoung
four   2015   jungjae

In [49]:
df.loc["two":"four", "year":"penalty"]

Info   year     names  points  penalty
Order
two    2017  sunyoung     3.7      0.2
three  2016  sunyoung     4.6      0.3
four   2015   jungjae     5.4      0.4

In [50]:
df

Info   year     names  points  penalty  debt
Order
one    2018  sunyoung     2.9      0.1   NaN
two    2017  sunyoung     3.7      0.2  -1.2
three  2016  sunyoung     4.6      0.3   NaN
four   2015   jungjae     5.4      0.4  -1.3
five   2018   jungjae     6.9      0.5  -1.4

In [51]:
df.loc["six", : ]  = [2019, "psy", 9.9, 10, 9.8]

In [52]:
df

Info     year     names  points  penalty  debt
Order
one    2018.0  sunyoung     2.9      0.1   NaN
two    2017.0  sunyoung     3.7      0.2  -1.2
three  2016.0  sunyoung     4.6      0.3   NaN
four   2015.0   jungjae     5.4      0.4  -1.3
five   2018.0   jungjae     6.9      0.5  -1.4
six    2019.0       psy     9.9     10.0   9.8

In [53]:
df.iloc[3]

Info
year          2015
names      jungjae
points         5.4
penalty        0.4
debt          -1.3
Name: four, dtype: object

In [54]:
df.iloc[3:5, 0:2]

Info     year    names
Order
four   2015.0  jungjae
five   2018.0  jungjae

In [55]:
df.iloc[ [1,3,5],[1,2] ]

Info      names  points
Order
two    sunyoung     3.7
four    jungjae     5.4
six         psy     9.9

In [56]:
df.iloc[ : , 1:4]

Info      names  points  penalty
Order
one    sunyoung     2.9      0.1
two    sunyoung     3.7      0.2
three  sunyoung     4.6      0.3
four    jungjae     5.4      0.4
five    jungjae     6.9      0.5
six         psy     9.9     10.0

In [57]:
df.iloc[1,1]

'sunyoung'

In [58]:
df["year"] >2017

Order
one       True
two      False
three    False
four     False
five      True
six       True
Name: year, dtype: bool

In [59]:
df.loc [ df["year"] >2017 , :]

Info     year     names  points  penalty  debt
Order
one    2018.0  sunyoung     2.9      0.1   NaN
five   2018.0   jungjae     6.9      0.5  -1.4
six    2019.0       psy     9.9     10.0   9.8

In [60]:
df

Info     year     names  points  penalty  debt
Order
one    2018.0  sunyoung     2.9      0.1   NaN
two    2017.0  sunyoung     3.7      0.2  -1.2
three  2016.0  sunyoung     4.6      0.3   NaN
four   2015.0   jungjae     5.4      0.4  -1.3
five   2018.0   jungjae     6.9      0.5  -1.4
six    2019.0       psy     9.9     10.0   9.8

In [61]:
df.loc[ df["names"] == "sunyoung" , ["names", "points"]]

Info      names  points
Order
one    sunyoung     2.9
two    sunyoung     3.7
three  sunyoung     4.6

In [62]:
df.loc[ ( df["points"] > 2) & (df["points"] < 3) , : ]

Info     year     names  points  penalty  debt
Order
one    2018.0  sunyoung     2.9      0.1   NaN

In [63]:
df.loc[df["points"] > 5, "penalty"] = 0

In [64]:
df

Info     year     names  points  penalty  debt
Order
one    2018.0  sunyoung     2.9      0.1   NaN
two    2017.0  sunyoung     3.7      0.2  -1.2
three  2016.0  sunyoung     4.6      0.3   NaN
four   2015.0   jungjae     5.4      0.0  -1.3
five   2018.0   jungjae     6.9      0.0  -1.4
six    2019.0       psy     9.9      0.0   9.8